## 005133826942: Alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 9 to add, 1 to change, 9 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.billing_change_over_threshold must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "billing_change_over_threshold" {
      ~ alarm_actions                         = [
          - "arn:aws:sns:us-east-1:005133826942:cloudwatch_alarm_cbs",
        ] -> (known after apply)
      ~ alarm_name                            = "BillingChangeOverThreshold" -> "CbsBillingChangeOverThreshold" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:us-east-1:005133826942:alarm:BillingChangeOverThreshold" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      - dimensions                            = {} -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "BillingChangeOverThreshold" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      ~ ok_actions                            = [
          - "arn:aws:sns:us-east-1:005133826942:cloudwatch_alarm_cbs",
        ] -> (known after apply)
      - period                                = 0 -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
      - threshold                             = 0 -> null
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_kms_key.sns_cloudwatch_us_east will be updated in-place
  ~ resource "aws_kms_key" "sns_cloudwatch_us_east" {
        id                                 = "df96d92a-8242-43f4-baa0-53e56bb96e51"
      ~ tags                               = {
          + "Product"    = "cloud-based-sensor"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                           = {
          + "Product"    = "cloud-based-sensor"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # aws_sns_topic.cloudwatch_alarm_us_east must be replaced
-/+ resource "aws_sns_topic" "cloudwatch_alarm_us_east" {
      - application_success_feedback_sample_rate = 0 -> null
      ~ arn                                      = "arn:aws:sns:us-east-1:005133826942:cloudwatch_alarm_cbs" -> (known after apply)
      - firehose_success_feedback_sample_rate    = 0 -> null
      - http_success_feedback_sample_rate        = 0 -> null
      ~ id                                       = "arn:aws:sns:us-east-1:005133826942:cloudwatch_alarm_cbs" -> (known after apply)
      - lambda_success_feedback_sample_rate      = 0 -> null
      ~ name                                     = "cloudwatch_alarm_cbs" -> "cbs-cloudwatch-alarm" # forces replacement
      + name_prefix                              = (known after apply)
      ~ owner                                    = "005133826942" -> (known after apply)
      ~ policy                                   = jsonencode(
            {
              - Id        = "__default_policy_ID"
              - Statement = [
                  - {
                      - Action    = [
                          - "SNS:GetTopicAttributes",
                          - "SNS:SetTopicAttributes",
                          - "SNS:AddPermission",
                          - "SNS:RemovePermission",
                          - "SNS:DeleteTopic",
                          - "SNS:Subscribe",
                          - "SNS:ListSubscriptionsByTopic",
                          - "SNS:Publish",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - AWS:SourceOwner = "005133826942"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "arn:aws:sns:us-east-1:005133826942:cloudwatch_alarm_cbs"
                      - Sid       = "__default_statement_ID"
                    },
                ]
              - Version   = "2008-10-17"
            }
        ) -> (known after apply)
      - sqs_success_feedback_sample_rate         = 0 -> null
        tags                                     = {
            "CostCentre" = "cbs-005133826942"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.cloudwatch_alarm_us_east must be replaced
-/+ resource "aws_sns_topic_subscription" "cloudwatch_alarm_us_east" {
      ~ arn                             = "arn:aws:sns:us-east-1:005133826942:cloudwatch_alarm_cbs:a4166433-e85e-4ec6-9b2e-7c6a99780eca" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ endpoint                        = "arn:aws:lambda:ca-central-1:005133826942:function:notify_slack_cbs" -> (known after apply) # forces replacement
      ~ id                              = "arn:aws:sns:us-east-1:005133826942:cloudwatch_alarm_cbs:a4166433-e85e-4ec6-9b2e-7c6a99780eca" -> (known after apply)
      ~ owner_id                        = "005133826942" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ topic_arn                       = "arn:aws:sns:us-east-1:005133826942:cloudwatch_alarm_cbs" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.notify_slack.data.aws_iam_policy_document.notify_slack_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "notify_slack_lambda"  {
      ~ id      = "3012963333" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/lambda/notify_slack_cbs"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/lambda/notify_slack_cbs",
              ~ (known after apply),
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # module.notify_slack.aws_cloudwatch_log_group.notify_slack_lambda must be replaced
-/+ resource "aws_cloudwatch_log_group" "notify_slack_lambda" {
      ~ arn               = "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/lambda/notify_slack_cbs" -> (known after apply)
      ~ id                = "/aws/lambda/notify_slack_cbs" -> (known after apply)
      ~ name              = "/aws/lambda/notify_slack_cbs" -> "/aws/lambda/cbs-notify-slack" # forces replacement
        tags              = {
            "CostCentre" = "cbs-005133826942"
        }
        # (2 unchanged attributes hidden)
    }

  # module.notify_slack.aws_iam_policy.notify_slack_lambda must be replaced
-/+ resource "aws_iam_policy" "notify_slack_lambda" {
      ~ arn       = "arn:aws:iam::005133826942:policy/NotifySlackLambda-notify_slack_cbs" -> (known after apply)
      ~ id        = "arn:aws:iam::005133826942:policy/NotifySlackLambda-notify_slack_cbs" -> (known after apply)
      ~ name      = "NotifySlackLambda-notify_slack_cbs" -> "NotifySlackLambda-cbs-notify-slack" # forces replacement
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:005133826942:log-group:/aws/lambda/notify_slack_cbs"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id = "ANPAQCMP77N7FWPR5IZQW" -> (known after apply)
      - tags      = {} -> null
      ~ tags_all  = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.notify_slack.aws_iam_role.notify_slack_lambda must be replaced
-/+ resource "aws_iam_role" "notify_slack_lambda" {
      ~ arn                   = "arn:aws:iam::005133826942:role/NotifySlackLambda-notify_slack_cbs" -> (known after apply)
      ~ assume_role_policy    = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "lambda.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ create_date           = "2022-02-24T16:32:01Z" -> (known after apply)
      ~ id                    = "NotifySlackLambda-notify_slack_cbs" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::005133826942:policy/NotifySlackLambda-notify_slack_cbs",
        ] -> (known after apply)
      ~ name                  = "NotifySlackLambda-notify_slack_cbs" -> "NotifySlackLambda-cbs-notify-slack" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROAQCMP77N7CRPQUXLJB" -> (known after apply)
        # (3 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.notify_slack.aws_iam_role_policy_attachment.notify_slack_lambda must be replaced
-/+ resource "aws_iam_role_policy_attachment" "notify_slack_lambda" {
      ~ id         = "NotifySlackLambda-notify_slack_cbs-20220224163203412800000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::005133826942:policy/NotifySlackLambda-notify_slack_cbs" -> (known after apply) # forces replacement
      ~ role       = "NotifySlackLambda-notify_slack_cbs" -> "NotifySlackLambda-cbs-notify-slack" # forces replacement
    }

  # module.notify_slack.aws_lambda_function.notify_slack must be replaced
-/+ resource "aws_lambda_function" "notify_slack" {
      ~ architectures                  = [] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ca-central-1:005133826942:function:notify_slack_cbs" -> (known after apply)
      - code_signing_config_arn        = "" -> null
      ~ function_name                  = "notify_slack_cbs" -> "cbs-notify-slack" # forces replacement
      ~ id                             = "notify_slack_cbs" -> (known after apply)
      - image_uri                      = "" -> null
      ~ invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:005133826942:function:notify_slack_cbs/invocations" -> (known after apply)
      - kms_key_arn                    = "" -> null
      ~ last_modified                  = "2022-03-07T16:21:45.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:005133826942:function:notify_slack_cbs:$LATEST" -> (known after apply)
      ~ role                           = "arn:aws:iam::005133826942:role/NotifySlackLambda-notify_slack_cbs" -> (known after apply)
      ~ signing_job_arn                = "" -> (known after apply)
      ~ signing_profile_version_arn    = "" -> (known after apply)
      ~ source_code_size               = 1595 -> (known after apply)
        tags                           = {
            "CostCentre" = "cbs-005133826942"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (11 unchanged attributes hidden)


      ~ tracing_config {
          ~ mode = "PassThrough" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # module.notify_slack.aws_lambda_permission.notify_slack[0] must be replaced
-/+ resource "aws_lambda_permission" "notify_slack" {
      ~ function_name = "notify_slack_cbs" -> "cbs-notify-slack" # forces replacement
      ~ id            = "AllowExecutionFromSNS-notify_slack_cbs-0" -> (known after apply)
      ~ source_arn    = "arn:aws:sns:us-east-1:005133826942:cloudwatch_alarm_cbs" -> (known after apply) # forces replacement
      ~ statement_id  = "AllowExecutionFromSNS-notify_slack_cbs-0" -> "AllowExecutionFromSNS-cbs-notify-slack-0" # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 9 to add, 1 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.billing_change_over_threshold"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_cloudwatch_log_group.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_iam_policy.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_iam_role.notify_slack_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.notify_slack.aws_lambda_function.notify_slack"]

13 tests, 8 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
